; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v6 ?v1)
             (pred_12 ?v3 ?v10)
             (pred_10 ?v6 ?v10)
             (pred_6 ?v7 ?v6 )
	     (pred_11 ?v6)
             (pred_7 ?v2)
             (pred_5 ?v3)
             (pred_3 ?v10)
             (pred_4 ?v6)
             (pred_9 ?v3)
             (pred_1 ?v6)
             (pred_8 ))



(:action op_4
:parameters (?v9 ?v13 ?v12 ?v11)
:precondition (and (pred_7 ?v9) (pred_7 ?v13) (pred_5 ?v12) (pred_3 ?v11)
          (pred_2 ?v9 ?v13) (pred_12 ?v12 ?v11)
                   (pred_10 ?v13 ?v11) (pred_11 ?v9) 
                   (pred_4 ?v13) (pred_9 ?v12))
:effect (and  (pred_1 ?v13) (not (pred_4 ?v13))))


(:action op_3
:parameters (?v9 ?v8)
:precondition (and (pred_7 ?v9) (pred_7 ?v8)
               (pred_11 ?v9) (pred_2 ?v9 ?v8) (pred_1 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v9))))

(:action op_5
:parameters (?v9 ?v12)
:precondition (and (pred_7 ?v9) (pred_5 ?v12) 
                  (pred_11 ?v9) (pred_6 ?v12 ?v9) (pred_8 ))
:effect (and (pred_9 ?v12)
   (not (pred_6 ?v12 ?v9)) (not (pred_8 ))))


(:action op_2
:parameters (?v9 ?v4 ?v5)
:precondition (and (pred_7 ?v9) (pred_5 ?v4) (pred_5 ?v5)
                  (pred_11 ?v9) (pred_9 ?v5) (pred_6 ?v4 ?v9))
:effect (and (pred_9 ?v4) (pred_6 ?v5 ?v9)
        (not (pred_9 ?v5)) (not (pred_6 ?v4 ?v9))))

(:action op_1
:parameters (?v9 ?v12)
:precondition (and (pred_7 ?v9) (pred_5 ?v12) 
                  (pred_11 ?v9) (pred_9 ?v12))
:effect (and (pred_8 ) (pred_6 ?v12 ?v9) (not (pred_9 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_28 obj_02 obj_16 obj_22 obj_17 obj_14 obj_09 obj_05 obj_25 obj_03 obj_07 obj_08 obj_26 obj_06 obj_27 obj_13 obj_01 obj_23 obj_24 obj_21 obj_20 obj_11 obj_30 obj_18
    obj_15 obj_29
    obj_12 obj_04 obj_10
    )

    (:init
       (pred_8)

       (pred_7 obj_19)
       (pred_7 obj_28)
       (pred_7 obj_02)
       (pred_7 obj_16)
       (pred_7 obj_22)
       (pred_7 obj_17)
       (pred_7 obj_14)
       (pred_7 obj_09)
       (pred_7 obj_05)
       (pred_7 obj_25)
       (pred_7 obj_03)
       (pred_7 obj_07)
       (pred_7 obj_08)
       (pred_7 obj_26)
       (pred_7 obj_06)
       (pred_7 obj_27)
       (pred_7 obj_13)
       (pred_7 obj_01)
       (pred_7 obj_23)
       (pred_7 obj_24)
       (pred_7 obj_21)
       (pred_7 obj_20)
       (pred_7 obj_11)
       (pred_7 obj_30)
       (pred_7 obj_18)
       (pred_3 obj_15)
       (pred_3 obj_29)
       (pred_5 obj_12)
       (pred_5 obj_04)
       (pred_5 obj_10)

       (pred_2 obj_19 obj_17)
       (pred_2 obj_19 obj_28)
       (pred_2 obj_28 obj_14)
       (pred_2 obj_28 obj_02)
       (pred_2 obj_28 obj_19)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_02 obj_16)
       (pred_2 obj_02 obj_28)
       (pred_2 obj_16 obj_05)
       (pred_2 obj_16 obj_22)
       (pred_2 obj_16 obj_02)
       (pred_2 obj_22 obj_25)
       (pred_2 obj_22 obj_16)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_17 obj_14)
       (pred_2 obj_17 obj_19)
       (pred_2 obj_14 obj_07)
       (pred_2 obj_14 obj_09)
       (pred_2 obj_14 obj_28)
       (pred_2 obj_14 obj_17)
       (pred_2 obj_09 obj_08)
       (pred_2 obj_09 obj_05)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_09 obj_14)
       (pred_2 obj_05 obj_26)
       (pred_2 obj_05 obj_25)
       (pred_2 obj_05 obj_16)
       (pred_2 obj_05 obj_09)
       (pred_2 obj_25 obj_06)
       (pred_2 obj_25 obj_22)
       (pred_2 obj_25 obj_05)
       (pred_2 obj_03 obj_27)
       (pred_2 obj_03 obj_07)
       (pred_2 obj_03 obj_17)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_14)
       (pred_2 obj_07 obj_03)
       (pred_2 obj_08 obj_01)
       (pred_2 obj_08 obj_26)
       (pred_2 obj_08 obj_09)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_26 obj_23)
       (pred_2 obj_26 obj_06)
       (pred_2 obj_26 obj_05)
       (pred_2 obj_26 obj_08)
       (pred_2 obj_06 obj_24)
       (pred_2 obj_06 obj_25)
       (pred_2 obj_06 obj_26)
       (pred_2 obj_27 obj_21)
       (pred_2 obj_27 obj_13)
       (pred_2 obj_27 obj_03)
       (pred_2 obj_13 obj_20)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_13 obj_27)
       (pred_2 obj_01 obj_11)
       (pred_2 obj_01 obj_23)
       (pred_2 obj_01 obj_08)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_23 obj_30)
       (pred_2 obj_23 obj_24)
       (pred_2 obj_23 obj_26)
       (pred_2 obj_23 obj_01)
       (pred_2 obj_24 obj_18)
       (pred_2 obj_24 obj_06)
       (pred_2 obj_24 obj_23)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_21 obj_27)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_20 obj_13)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_11 obj_30)
       (pred_2 obj_11 obj_01)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_30 obj_18)
       (pred_2 obj_30 obj_23)
       (pred_2 obj_30 obj_11)
       (pred_2 obj_18 obj_24)
       (pred_2 obj_18 obj_30)
       (pred_4 obj_20)
       (pred_4 obj_03)
       (pred_4 obj_14)
       (pred_10  obj_20 obj_15)
       (pred_10  obj_03 obj_29)
       (pred_10  obj_14 obj_29)
       (pred_1 obj_19)
       (pred_1 obj_28)
       (pred_1 obj_02)
       (pred_1 obj_16)
       (pred_1 obj_22)
       (pred_1 obj_17)
       (pred_1 obj_09)
       (pred_1 obj_05)
       (pred_1 obj_25)
       (pred_1 obj_07)
       (pred_1 obj_08)
       (pred_1 obj_26)
       (pred_1 obj_06)
       (pred_1 obj_27)
       (pred_1 obj_13)
       (pred_1 obj_01)
       (pred_1 obj_23)
       (pred_1 obj_24)
       (pred_1 obj_21)
       (pred_1 obj_11)
       (pred_1 obj_30)
       (pred_1 obj_18)

       (pred_12  obj_12 obj_15)
       (pred_12  obj_04 obj_29)
       (pred_12  obj_10 obj_15)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_04 obj_25)
       (pred_6 obj_10 obj_08)
       (pred_11 obj_11)
    )

    (:goal (and
       (pred_6 obj_12 obj_18)
       (pred_6 obj_04 obj_13)
    ))
(:constraints
  (always (not (pred_11 obj_09)))
)
)

; plan
1. (op_3 obj_11 obj_30)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_30)
   goals met: 0 of 2
2. (op_3 obj_30 obj_18)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_18)
   goals met: 0 of 2
3. (op_3 obj_18 obj_24)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_24)
   goals met: 0 of 2
4. (op_3 obj_24 obj_06)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_06)
   goals met: 0 of 2
5. (op_3 obj_06 obj_25)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_25)
   goals met: 0 of 2
6. (op_5 obj_25 obj_04)
   deleted: (pred_6 obj_04 obj_25) (pred_8)
   added: (pred_9 obj_04)
   goals met: 0 of 2
7. (op_3 obj_25 obj_06)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_06)
   goals met: 0 of 2
8. (op_3 obj_06 obj_24)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_24)
   goals met: 0 of 2
9. (op_3 obj_24 obj_18)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_18)
   goals met: 0 of 2
10. (op_1 obj_18 obj_04)
   deleted: (pred_9 obj_04)
   added: (pred_8) (pred_6 obj_04 obj_18)
   goals met: 0 of 2
11. (op_3 obj_18 obj_24)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_24)
   goals met: 0 of 2
12. (op_3 obj_24 obj_23)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_23)
   goals met: 0 of 2
13. (op_3 obj_23 obj_01)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_01)
   goals met: 0 of 2
14. (op_3 obj_01 obj_08)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_08)
   goals met: 0 of 2
15. (op_5 obj_08 obj_10)
   deleted: (pred_6 obj_10 obj_08) (pred_8)
   added: (pred_9 obj_10)
   goals met: 0 of 2
16. (op_3 obj_08 obj_07)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_07)
   goals met: 0 of 2
17. (op_3 obj_07 obj_13)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_13)
   goals met: 0 of 2
18. (op_1 obj_13 obj_10)
   deleted: (pred_9 obj_10)
   added: (pred_8) (pred_6 obj_10 obj_13)
   goals met: 0 of 2
19. (op_3 obj_13 obj_01)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_01)
   goals met: 0 of 2
20. (op_3 obj_01 obj_23)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_23)
   goals met: 0 of 2
21. (op_3 obj_23 obj_24)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_24)
   goals met: 0 of 2
22. (op_3 obj_24 obj_18)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_18)
   goals met: 0 of 2
23. (op_5 obj_18 obj_04)
   deleted: (pred_6 obj_04 obj_18) (pred_8)
   added: (pred_9 obj_04)
   goals met: 0 of 2
24. (op_3 obj_18 obj_24)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_24)
   goals met: 0 of 2
25. (op_3 obj_24 obj_23)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_23)
   goals met: 0 of 2
26. (op_3 obj_23 obj_01)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_01)
   goals met: 0 of 2
27. (op_3 obj_01 obj_13)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_13)
   goals met: 0 of 2
28. (op_1 obj_13 obj_04)
   deleted: (pred_9 obj_04)
   added: (pred_8) (pred_6 obj_04 obj_13)
   goals met: 1 of 2
29. (op_3 obj_13 obj_07)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_07)
   goals met: 1 of 2
30. (op_3 obj_07 obj_08)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_08)
   goals met: 1 of 2
31. (op_3 obj_08 obj_26)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_26)
   goals met: 1 of 2
32. (op_3 obj_26 obj_05)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_05)
   goals met: 1 of 2
33. (op_3 obj_05 obj_16)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_16)
   goals met: 1 of 2
34. (op_3 obj_16 obj_02)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_02)
   goals met: 1 of 2
35. (op_3 obj_02 obj_28)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_28)
   goals met: 1 of 2
36. (op_3 obj_28 obj_19)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_19)
   goals met: 1 of 2
37. (op_5 obj_19 obj_12)
   deleted: (pred_6 obj_12 obj_19) (pred_8)
   added: (pred_9 obj_12)
   goals met: 1 of 2
38. (op_3 obj_19 obj_28)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_28)
   goals met: 1 of 2
39. (op_3 obj_28 obj_02)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_02)
   goals met: 1 of 2
40. (op_3 obj_02 obj_16)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_16)
   goals met: 1 of 2
41. (op_3 obj_16 obj_22)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_22)
   goals met: 1 of 2
42. (op_3 obj_22 obj_25)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_25)
   goals met: 1 of 2
43. (op_3 obj_25 obj_06)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_06)
   goals met: 1 of 2
44. (op_3 obj_06 obj_24)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_24)
   goals met: 1 of 2
45. (op_3 obj_24 obj_18)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_18)
   goals met: 1 of 2
46. (op_1 obj_18 obj_12)
   deleted: (pred_9 obj_12)
   added: (pred_8) (pred_6 obj_12 obj_18)
   goals met: 2 of 2
